Tasks/DMS_ЗаявкаНаСогласование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Task>
		<Properties>
			<Name>DMS_ЗаявкаНаСогласование</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыЗаявокНаСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МоментВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникАвтора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСообщения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ид</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.DMS_РеквизитыЗаявкиНаСогласование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.DMS_РеквизитыЗаявкиНаСогласование</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Catalogs/DMS_СоставЗаявкиКорпКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_СоставЗаявкиКорпКлиента</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:TaskRef.DMS_ЗаявкаНаСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>17</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантСалона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ВариантыСалона</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветСалона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ЦветаСалона</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВПроизводство</Name>
							<Comment>Количество в произодство</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Discont</Name>
							<Comment>Скидка одобренная дилеру сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Discont_proc</Name>
							<Comment>Скидка одобренная дилеру в процентах</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Bonus</Name>
							<Comment>Бонус дилера сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Bonus_proc</Name>
							<Comment>Бонус дилера процент</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/DMS_РеквизитыЗаявкиНаСогласование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>DMS_РеквизитыЗаявкиНаСогласование</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>250</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ВидыЗаявок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗаявкиНаСогласование</Name>
							<Type>
								<v8:Type>cfg:EnumRef.DMS_ВидыЗаявокНаСогласование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Comment>Обязательный реквизит для заполнения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Интерактивный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Tasks/DMS_ЗаявкаНаСогласование/Forms/ФормаЗадачи/Ext/Form/Module.bsl
//Процедура ПриЧтенииНаСервере(ТекущийОбъект)
//	Если ТекущийОбъект.ЭтоНовый() Тогда
//		ТекущийОбъект.УстановитьСсылкуНового(Новый УникальныйИдентификатор()) //ссылка понядобится при записи связанного справочника DMS_СоставЗаявкиКорпКлиента
//	КонецЕсли;	
//КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	DMS_ОбщиеФункцииСервер.МультибрендОсновноеОформление(ЭтаФорма); //мультибренд
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	
	Элементы.Организация.Видимость=Константы.DMS_НесколькоОрганизацийНаОдинBIR.Получить();
	
	Если Объект.Ссылка.Пустая() Тогда 
		Если Объект.ДилерскийЦентр.Пустая() Тогда Объект.ДилерскийЦентр=ПараметрыСеанса.DMS_ТекущийДилерскийЦентр; КонецЕсли;
		Если Объект.Организация.Пустая() Тогда Объект.Организация=ПараметрыСеанса.DMS_ТекущаяОрганизация; КонецЕсли;
		Если Объект.Подразделение.Пустая() Тогда Объект.Подразделение=ПараметрыСеанса.DMS_ТекущееПодразделение; КонецЕсли;
		Объект.Менеджер=ПараметрыСеанса.ТекущийПользователь;
		Объект.Состояние=Справочники.DMS_Состояния.НаРассмотрении;
		ЗаполнитьОрганизацию();
		ЗаполнитьРеквизиты();
		
	Иначе
		ТолькоПросмотр=Объект.Закрыта; // на чтение
		
		//табличная часть "Состав"
		Если Объект.ВидЗаявки=Перечисления.DMS_ВидыЗаявокНаСогласование.КорпоративнаяПродажа Тогда
			Запрос=Новый Запрос("Выбрать * Из Справочник.DMS_СоставЗаявкиКорпКлиента.Состав ГДЕ Ссылка.Заявка=&Заявка");
			Запрос.УстановитьПараметр("Заявка",Объект.Ссылка);
			Состав.Загрузить(Запрос.Выполнить().Выгрузить());
		КонецЕсли;	
	КонецЕсли;
	
	//ТекСтрокаСостав=-1;
	УправлениеЭлементами();
	
КонецПроцедуры
Процедура УправлениеЭлементами()
	Если ЗначениеЗаполнено(Объект.СрокДействия) Тогда ТолькоПросмотр=Объект.СрокДействия<ТекущаяДата() КонецЕсли;	
	
	Элементы.Состав.Видимость=Объект.ВидЗаявки=Перечисления.DMS_ВидыЗаявокНаСогласование.КорпоративнаяПродажа;
	//Элементы.ПодменюПечатьОбычное_VAZ_КорпоративнаяЗаявка.Видимость = Объект.ВидЗаявки = Перечисления.DMS_ВидыЗаявокНаСогласование.КорпоративнаяПродажа;
	
	//отметка обязательных реквизитов для условного оформления
	СоставРеквизитов=СоставРеквизитов();
	Для Каждого Стр Из Объект.Реквизиты Цикл
		СтрСостава=СоставРеквизитов.Найти(Стр.Реквизит,"Реквизит");
		Если СтрСостава<>Неопределено Тогда Стр.Обязательный=СтрСостава.Обязательный КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ДилерскийЦентрПриИзменении(Элемент) ЗаполнитьОрганизацию() КонецПроцедуры
Процедура ЗаполнитьОрганизацию() Объект.Организация=Объект.ДилерскийЦентр.Организация КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент) ЗаполнитьЗначенияРеквизитов() КонецПроцедуры

Функция СоставРеквизитов()
	Запрос=Новый Запрос("Выбрать Ссылка Реквизит,Обязательный Из ПланВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.ВидыЗаявок ГДЕ ВидЗаявкиНаСогласование=&ВидЗаявки И Интерактивный Упорядочить По Обязательный Убыв");
	Запрос.УстановитьПараметр("ВидЗаявки",Объект.ВидЗаявки);
	Возврат Запрос.Выполнить().Выгрузить()
КонецФункции	

&НаКлиенте
Процедура ВидЗаявкиПриИзменении(Элемент) ЗаполнитьРеквизиты(); УправлениеЭлементами(); КонецПроцедуры
Процедура ЗаполнитьРеквизиты()
	//Объект.Реквизиты.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого Реквизит Из СоставРеквизитов().ВыгрузитьКолонку("Реквизит") Цикл
		Если Объект.Реквизиты.НайтиСтроки(Новый Структура("Реквизит",Реквизит)).Количество()=0 Тогда
			Объект.Реквизиты.Добавить().Реквизит=Реквизит
		КонецЕсли;	
	КонецЦикла;	
	ЗаполнитьЗначенияРеквизитов();
КонецПроцедуры	
Процедура ЗаполнитьЗначенияРеквизитов()
	//Если Не ЗначениеЗаполнено(Объект.Основание) Тогда Возврат
	//ИначеЕсли ТипЗнч(Объект.Основание)=Тип("ДокументСсылка.DMS_ВыдачаАвтомобиля") Тогда
		Для Каждого Стр Из Объект.Реквизиты Цикл
			Если ЗначениеЗаполнено(Стр.Значение) Тогда Продолжить КонецЕсли;
			Если Стр.Реквизит=ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.Автомобиль И ТипЗнч(Объект.Основание)=Тип("ДокументСсылка.DMS_ВыдачаАвтомобиля") Тогда Стр.Значение=Объект.Основание.Автомобиль;
			ИначеЕсли Стр.Реквизит=ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.ЖелаемыйГодПроизводства Тогда Стр.Значение=Год(ТекущаяДата()+75*86400);	
			ИначеЕсли Стр.Реквизит=ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.ЖелаемыйМесяцПроизводства Тогда Стр.Значение=Месяц(ТекущаяДата()+75*86400);	
			ИначеЕсли Стр.Реквизит=ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.Клиент И ТипЗнч(Объект.Основание)=Тип("ДокументСсылка.DMS_ВыдачаАвтомобиля") Тогда Стр.Значение=Объект.Основание.Контрагент;
			ИначеЕсли Стр.Реквизит=ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.КорпоративныйКлиент И ТипЗнч(Объект.Основание)=Тип("ДокументСсылка.DMS_ВыдачаАвтомобиля") Тогда Стр.Значение=Справочники.DMS_КорпоративныеКлиенты.КорпоративныйКлиент(Объект.Основание.Контрагент,Объект.ДилерскийЦентр);
			КонецЕсли;				
		КонецЦикла;	
	//КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СообщенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Отказ=Истина; ДобавитьСообщение() КонецПроцедуры
Процедура ДобавитьСообщение()
	Строка=Объект.Сообщения.Добавить();
	Строка.Ид=Новый УникальныйИдентификатор;
	Строка.Дата=ТекущаяДата();
	Строка.Автор=Объект.Менеджер;
КонецПроцедуры	

&НаСервере
//запрет редактирования чужих сообщений
Процедура СообщенияПередНачаломИзменения(Элемент, Отказ) Если Элементы.Сообщения.ТекущиеДанные.Автор<>Объект.Менеджер Тогда Отказ=Истина КонецЕсли КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) Объект.Наименование=Объект.ВидЗаявки КонецПроцедуры
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//запишем связанный справочник
	Если Объект.ВидЗаявки=Перечисления.DMS_ВидыЗаявокНаСогласование.КорпоративнаяПродажа Тогда
		
		Если Состав.Количество()=0 Тогда
			Отказ=Истина;
			Сообщить("Не указан состав автомобилей");
			Возврат
		КонецЕсли;	
		
		//ссылка понядобится при записи связанного справочника DMS_СоставЗаявкиКорпКлиента
		Если ТекущийОбъект.ЭтоНовый() Тогда
			ТекущийОбъект.УстановитьСсылкуНового(Задачи.DMS_ЗаявкаНаСогласование.ПолучитьСсылку(Новый УникальныйИдентификатор)) 
		КонецЕсли;	
		
		ЭтаСсылка=?(ТекущийОбъект.ЭтоНовый(),ТекущийОбъект.ПолучитьСсылкуНового(),ТекущийОбъект.Ссылка);
		
		Запрос=Новый Запрос("Выбрать Ссылка Из Справочник.DMS_СоставЗаявкиКорпКлиента ГДЕ Заявка=&Заявка");
		Запрос.УстановитьПараметр("Заявка",ЭтаСсылка);
		Выборка=Запрос.Выполнить().Выбрать();
		СоставЗаявки=?(Выборка.Следующий(),Выборка.Ссылка.ПолучитьОбъект(),Справочники.DMS_СоставЗаявкиКорпКлиента.СоздатьЭлемент());
		СоставЗаявки.Заявка=ЭтаСсылка;
		СоставЗаявки.Состав.Загрузить(Состав.Выгрузить());	
		СоставЗаявки.Записать();
		
		//обязательный реквизит 
		СтрокиРекв=Объект.Реквизиты.НайтиСтроки(Новый Структура("Реквизит",ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.СоставЗаявки));
		Строка=?(СтрокиРекв.Количество()>0,СтрокиРекв[0],ТекущийОбъект.Реквизиты.Добавить());
		Строка.Реквизит=ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.СоставЗаявки;
		Строка.Значение=СоставЗаявки.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура кнОтправитьНаСогласование(Команда)
	Объект.Выполнена=Истина;
	Записать();
	Закрыть();
КонецПроцедуры

//&НаКлиенте
//Процедура кнДобавитьАвтомобиль(Команда)
//	СтандартнаяОбработка=Ложь;
//	
//	Сп=Новый СписокЗначений;
//	Сп.Добавить("Автосклад");
//	Сп.Добавить("СписокАтомобилей","Список автомобилей");
//	
//	Парам=Новый Структура;
//	Парам.Вставить("Список",Сп);
//	Парам.Вставить("Заголовок","Способ подбора автомобиля");
//	Парам.Вставить("КоличествоЭлементовВСтроке",2);
//	Парам.Вставить("ШиринаЭлемента",17);
//	Парам.Вставить("ВысотаЭлемента",2);
//	ОткрытьФорму("Обработка.DMS_Диалог.Форма.ДиалогВыбораСписка",Парам,ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("СпособВыбораАвто",ЭтаФорма));
//КонецПроцедуры
//&НаКлиенте
//Процедура СпособВыбораАвто(Способ,Парам) Экспорт
//	Оповещение=Новый ОписаниеОповещения("ОкончаниеВыбораАвтомобиля", ЭтотОбъект);
//	Если Способ="Автосклад" Тогда
//		ОткрытьФорму("РегистрСведений.DMS_Автосклад.ФормаСписка",Новый Структура("РежимВыбора",Истина),ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
//	ИначеЕсли Способ="СписокАтомобилей" Тогда
//		ОткрытьФорму("РегистрСведений.DMS_Автомобили.ФормаСписка",Новый Структура("РежимВыбора",Истина),ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
//	КонецЕсли;	
//КонецПроцедуры
//&НаКлиенте
//Процедура ОкончаниеВыбораАвтомобиля(Автомобиль, ДополнительныеПараметры) Экспорт
//	Если Автомобиль=Неопределено Тогда Возврат КонецЕсли;
//	Строка=Состав.Добавить();
//	Строка.Автомобиль=DMS_Автомобили.Автомобиль(Автомобиль,"VIN");
//	Строка.Количество=1;
//КонецПроцедуры

//&НаКлиенте
//Процедура кнКонфигурация(Команда)
//	СтандартнаяОбработка=Ложь;
//	Парам=Новый Структура("Производитель",DMS_ДилерскиеЦентры.ДилерскийЦентр(Объект.ДилерскийЦентр,"Производитель"));
//	ОткрытьФорму("Документ.DMS_КоммерческоеПредложение.Форма.ФормаКонфигуратора",Парам,ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыКонфигуратора",ЭтаФорма));
//КонецПроцедуры
//&НаКлиенте 
//Процедура ПослеЗакрытияФормыКонфигуратора(Ответ, ДопПараметр) Экспорт
//	Если Ответ=Неопределено Тогда Возврат КонецЕсли;		
//	Строка=Состав.Добавить();
//	Строка.Автомобиль=Ответ.ВариантКомплектации;
//	Строка.Цвет=Ответ.Цвет;
//	Строка.ВариантСалона=Ответ.ВариантСалона;
//	Строка.ЦветСалона=Ответ.ЦветСалона;
//	Строка.Количество=1;
//КонецПроцедуры

#Область ВыборАвтомобиляКонфигурации
&НаКлиенте
Процедура АвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Оповещение=Новый ОписаниеОповещения("ОпределитьСпособВыбораАвто",ЭтаФорма);
	Сп=Новый СписокЗначений;
	Сп.Добавить(1,"Автомобили");
	Сп.Добавить(2,"Автосклад");
	Сп.Добавить(3,"Конфигурация");
	ПоказатьВопрос(Оповещение,"Способ подбора автомобиля",Сп);
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьСпособВыбораАвто(Выбор,Парам) Экспорт
	ИдСтрокиСостав=Элементы.Состав.ТекущаяСтрока;
	Производитель=DMS_ОбщиеФункцииСервер.ПолучитьНаСервере("vars.Производитель",Объект.ДилерскийЦентр);
	Если Выбор=1 Тогда //автомобили
		Оповещение=Новый ОписаниеОповещения("ОкончаниеВыбораАвтомобиля",ЭтотОбъект,ИдСтрокиСостав);
		ОткрытьФорму("РегистрСведений.DMS_Автомобили.ФормаСписка",Новый Структура("РежимВыбора,АктивныйЭлемент,Производитель",Истина,Элементы.Состав.ТекущиеДанные.Автомобиль,Производитель),ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
	ИначеЕсли Выбор=2 Тогда //автосклад, АктивныйЭлемент тут бесполезен т.к. в динамическом списке нет основной таблицы
		Оповещение=Новый ОписаниеОповещения("ОкончаниеВыбораАвтомобиля",ЭтотОбъект,ИдСтрокиСостав);
		ОткрытьФорму("РегистрСведений.DMS_Автосклад.ФормаСписка",Новый Структура("РежимВыбора,Производитель",Истина,Производитель),ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
	ИначеЕсли Выбор=3 Тогда //конфигурация
		Оповещение=Новый ОписаниеОповещения("ОкончаниеВыбораКонфигурации",ЭтотОбъект,ИдСтрокиСостав);
		ОткрытьФорму("Документ.DMS_КоммерческоеПредложение.Форма.ФормаКонфигуратора",ПараметрыКонфигуратора(ИдСтрокиСостав),ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
	КонецЕсли;	
КонецПроцедуры
Функция ПараметрыКонфигуратора(ИдСтрокиСостав)
	СтрокаСостав=Состав.НайтиПоИдентификатору(ИдСтрокиСостав);
	Стр=Новый Структура;
	Стр.Вставить("Производитель",Объект.ДилерскийЦентр.Производитель);
	Стр.Вставить("Модель",?(ТипЗнч(СтрокаСостав.Автомобиль)=Тип("СправочникСсылка.DMS_ВариантыКомплектации"),СтрокаСостав.Автомобиль.Модель,Справочники.DMS_Модели.ПустаяСсылка()));
	Стр.Вставить("ВариантКомплектации",?(ТипЗнч(СтрокаСостав.Автомобиль)=Тип("СправочникСсылка.DMS_ВариантыКомплектации"),СтрокаСостав.Автомобиль,Справочники.DMS_ВариантыКомплектации.ПустаяСсылка()));
	Стр.Вставить("Цвет",СтрокаСостав.Цвет);
	Стр.Вставить("ВариантСалона",СтрокаСостав.ВариантСалона);
	Стр.Вставить("ЦветСалона",СтрокаСостав.ЦветСалона);
	Стр.Вставить("Корпоративный",Истина); //этот вызов всегда из заявки на корп продажи
	Возврат Стр
КонецФункции

&НаКлиенте
Процедура ОкончаниеВыбораАвтомобиля(Ответ,ИдСтрокиСостав) Экспорт 
	Если Ответ=Неопределено Тогда Возврат КонецЕсли;
	СтрокаСостав=Состав.НайтиПоИдентификатору(ИдСтрокиСостав);
	
	СтрокаСостав.Количество=1;
	СтрокаСостав.Автомобиль=Ответ; 
	ЗаполнитьРеквизитыАвто(ИдСтрокиСостав); 
КонецПроцедуры	
Процедура ЗаполнитьРеквизитыАвто(ИдСтрокиСостав)
	СтрокаСостав=Состав.НайтиПоИдентификатору(ИдСтрокиСостав);
	Реквизиты=DMS_Автомобили.Автомобиль(СтрокаСостав.Автомобиль,"VIN,SEDRE_ORDER,NumCl,NumDevis,Цвет,ЦветСалона,ВариантСалона");
	ЗаполнитьЗначенияСвойств(СтрокаСостав,Реквизиты);
КонецПроцедуры	

&НаКлиенте
Процедура ОкончаниеВыбораКонфигурации(Ответ,ИдСтрокиСостав) Экспорт
	Если Ответ=Неопределено Тогда Возврат КонецЕсли;
	СтрокаСостав=Состав.НайтиПоИдентификатору(ИдСтрокиСостав);
		
	СтрокаСостав.Количество=1;
	СтрокаСостав.Автомобиль=Ответ.ВариантКомплектации;
	СтрокаСостав.Цвет=Ответ.Цвет;
	СтрокаСостав.ЦветСалона=Ответ.ЦветСалона;
	СтрокаСостав.ВариантСалона=Ответ.ВариантСалона;
КонецПроцедуры	
#КонецОбласти

//#Область ОтборПолейТЧСостав
//&НаКлиенте
//Процедура СоставПриАктивизацииСтроки(Элемент)
//	Если Элементы.Состав.ТекущиеДанные=Неопределено ИЛИ Элементы.Состав.ТекущаяСтрока=ТекСтрокаСостав Тогда Возврат КонецЕсли;
//	ТекСтрокаСостав=Элементы.Состав.ТекущаяСтрока; 
//	ВариантКомплектации=ПолучитьВариантКомплектации(Элементы.Состав.ТекущиеДанные.Автомобиль);
//	ОтборВариантСалона(ВариантКомплектации);
//	ОтборЦветСалона(ВариантКомплектации);
//КонецПроцедуры
//Процедура ОтборВариантСалона(ВариантКомплектации)
//	Запрос=Новый Запрос("Выбрать ВариантСалона Из РегистрСведений.DMS_ВариантыСалона ГДЕ ВариантКомплектации=&ВариантКомплектации");
//	Запрос.УстановитьПараметр("ВариантКомплектации",ВариантКомплектации);
//	Массив=Новый Массив;
//	Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",Новый ФиксированныйМассив(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВариантСалона"))));
//	Элементы.ВариантСалона.ПараметрыВыбора=Новый ФиксированныйМассив(Массив);
//КонецПроцедуры	
//Процедура ОтборЦветСалона(ВариантКомплектации)
//	Запрос=Новый Запрос("Выбрать ЦветСалона Из РегистрСведений.DMS_ЦветаСалона ГДЕ ВариантКомплектации=&ВариантКомплектации");
//	Запрос.УстановитьПараметр("ВариантКомплектации",ВариантКомплектации);
//	Массив=Новый Массив;
//	Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",Новый ФиксированныйМассив(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦветСалона"))));
//	Элементы.ЦветСалона.ПараметрыВыбора=Новый ФиксированныйМассив(Массив);
//КонецПроцедуры
//Функция ПолучитьВариантКомплектации(Автомобиль)
//	Если ТипЗнч(Автомобиль)=Тип("СправочникСсылка.DMS_ВариантыКомплектации") Тогда Возврат Автомобиль
//	Иначе Возврат DMS_Автомобили.Автомобиль(DMS_Автомобили.АвтомобильПоVIN(Автомобиль),"ВариантКомплектации") //строка
//	КонецЕсли;	
//КонецФункции	
//#КонецОбласти

//&НаКлиенте
//Процедура ПечатьГарантийногоТалона(Команда)
//	Ответ = ПечатьГарантийногоТалонаНаСервере();
//	Если Ответ = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	Если ТипЗнч(Ответ) = Тип("Строка") Тогда
//		Сообщить(Ответ);
//	ИначеЕсли ТипЗнч(Ответ) = Тип("ТабличныйДокумент") Тогда
//		Ответ.АвтоМасштаб = Истина;
//		Ответ.Показать();
//		//Ответ.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
//	Иначе
//		Сообщить("Не удалось получить гарантийный талон");
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Функция ПечатьГарантийногоТалонаНаСервере()
//	Перем Ответ;
//	Если Объект.Состояние <> Справочники.DMS_Состояния.Согласовано Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	ПараметрыЗаявки = Новый Структура;
//	ПараметрыЗаявки.Вставить("VIN", Строка(Объект.Наименование));
//	ПараметрыЗаявки.Вставить("ПараметрыТалона",Неопределено);
//	ПараметрыЗаявки.Вставить("ЗаявкаНаПовторнуюПечать", Неопределено);

//	ПакетДляПередачи = DMS_DataExchange.newPackage(ПараметрыЗаявки); 
//	ПарамПодключения=DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,DMS_ДилерскиеЦентры.ДилерскийЦентр(Объект.Организация,"Производитель"));
//	Если DMS_DataExchange.sendMessage(ПарамПодключения,"ConsolidationHTTP", "DMS_GuaranteeDocs.ПолучитьТабличныйДокумент",ПакетДляПередачи, Ответ) Тогда
//		Возврат Ответ
//	Иначе	
//		Сообщить(Ответ);
//		Возврат Неопределено
//	КонецЕсли;	
//КонецФункции

#Область СтандартныеПодсистемы
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект) 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект) 
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура кнПоказатьАвтосклад(Команда) ОткрытьФорму("РегистрСведений.DMS_Автосклад.ФормаСписка",Новый Структура("Автомобили",АвтомобилиПоЗаявке()),ЭтаФорма,УникальныйИдентификатор) КонецПроцедуры
Функция АвтомобилиПоЗаявке()
	Запрос=Новый Запрос("Выбрать Автомобиль Из РегистрСведений.DMS_Автосклад ГДЕ NUM_CorpOrder=&НомерЗаявки");
	Запрос.УстановитьПараметр("НомерЗаявки",Задачи.DMS_ЗаявкаНаСогласование.ЗначенияРеквизитов(Объект.Ссылка,"NUM_CorpOrder"));
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Автомобиль")
	Результат=Запрос.Выполнить();
	Сп=Новый СписокЗначений;
	Если Результат.Пустой() Тогда Сп.Добавить(Справочники.Номенклатура.ПустаяСсылка())
	Иначе Сп.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Автомобиль"))
	КонецЕсли;	
	Возврат Сп
КонецФункции
